app/Controllers/c_livechat.php

    public function edit($id) // ini yang dituju oleh routes.php dan membawa data yang dipilih dari tabel
    {
        $livechat = $this->livechat->find($id);
        $data = [
            'title' => 'Edit Livechat SIJAWARA', // title untuk di tampilkan di tab browser
            'kategori' => $this->kategori->findAll(),  // ini mengambil semua data ke model m_livechat
            'livechat' => $livechat,  // ini mengambil semua data ke model m_livechat
        ];
---
SELECT *
FROM `tbl_kategori`

    public function update($id) // ini yang dituju oleh routes.php dengan membawa parameter
    {
        // Menangkap nilai yang dikirim dari inputan dibungkus dalam 1 variable yaitu $data
        $data = [

            // tanggal_aduan yang kiri adalah yang sesuai dengan kolom yang ada di tbl_livechat
            'tanggal_aduan' => $this->request->getPost('tanggal_aduan'), // tanggal_aduan yang kanan menangkap nilai dari input yang name nya tanggal_aduan

            // kategori_id yang kiri adalah yang sesuai dengan kolom yang ada di tbl_livechat
            'kategori_id' => $this->request->getPost('kategori_id'), // kategori_id yang kanan menangkap nilai dari input yang name nya kategori_id

            // keterangan yang kiri adalah yang sesuai dengan kolom yang ada di tbl_livechat
            'keterangan' => $this->request->getPost('keterangan'), // keterangan yang kanan menangkap nilai dari input yang name nya keterangan

            // user_id yang kiri adalah yang sesuai dengan kolom yang ada di tbl_livechat
            'user_id' => $this->request->getPost('user_id'), // user_id yang kanan menangkap nilai dari input yang name nya user_id

            // status yang kiri adalah yang sesuai dengan kolom yang ada di tbl_livechat
            'status' => $this->request->getPost('status'), // status yang kanan menangkap nilai dari input yang name nya status
        ];

        $this->livechat->update($id, $data); // mengirim data ke model m_livechat untuk diubah ke database berdasarkan id yang dipilih
---
UPDATE `tbl_livechat` SET `tanggal_aduan` = '2023-11-27', `kategori_id` = '2', `keterangan` = 'test', `user_id` = '3', `status` = '0'
WHERE `tbl_livechat`.`id_livechat` IN ('1')