app/Controllers/c_login.php

SELECT *
FROM `tbl_user`
WHERE `username` = 'operator'
 LIMIT 1
---
    public function cekLogin() // ini yang dituju oleh routes.php
    {
        $username = $this->request->getPost('username'); // menampung inputan username yang ada di view_login
        $password = MD5($this->request->getPost('password')); // menampung inputan password yang ada di view_login
        $user =  $this->user->where('username', $username)->first(); // untuk cek ke tabel user