app/Models/m_livechat.php

    function getJumlahAduan($status = '', $waktu = ''){
        if ($waktu != '') {
            $this->like('tanggal_aduan', $waktu);
        }
        if ($status != '') {
            $this->where('status', $status);
        }
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_livechat`

    function getJumlahAduanUser($id = '', $status='')
    {
        if ($status != '') {
            $this->where('status', $status);
        }
        if ($id != '') {
            $this->where('user_id', $id);
        }
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_livechat`